perf/exchange.yaml
config:
  environments:
    api:
      target: "http://localhost:5555"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 5
    - name: Plain
      duration: 180
      arrivalRate: 20

  payload:
    path: ./exchange-data.csv
    fields:
      - baseCurrency
      - counterCurrency
      - baseAccountId
      - counterAccountId
      - baseAmount
    order: random # Toma aleatoriamente una fila del CSV

scenarios:
  - name: Exchange (/exchange)
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "{{ baseCurrency }}"
            counterCurrency: "{{ counterCurrency }}"
            baseAccountId: "{{ baseAccountId }}"
            counterAccountId: "{{ counterAccountId }}"
            baseAmount: "{{ baseAmount }}" # <-- valor dinámico entre 1 y 5